"""
탐색 방법 중 하나로 테이블에 있는 레코드를 하나씩 비교하는 것이 아닌
레코드가 저장되어 있는 위치를 직접 계산하는 것이다.

연산: 탐색 키로부터 레코드가 있어야 할 위치를 계산, 해당 위치에 레코드가 있는지 확인

해싱에서 킷값으로부터 레코드가 저장될 위치를 계산하는 함수를 해시 함수(Hash Function)
해시 함수에 의해 계산된 위치에 레코드를 저장한 테이블을 해시 테이블(Hash Table)
해시 테이블은 M개의 버킷(bucket)으로 이루어져있으며 하나의 버킷은 여러 슬록(slot)을 가진다.
하나의 슬롯에는 하나의 레코드가 저장된다.

연산 결과는 하나의 주소값을 가지게 되는데, 이는 버킷을 가리킨다.
그러나 버킷은 제한된 슬롯 수를 가지고 있기에 넣고 싶은만큼 넣을 수가 없다.
따라서 버킷에 더 이상 항목을 저장할 수 없게 되는 오버플로를 해결해야 한다.
"""

class Hashing:
  # 제산 함수
  def modular(self, key):
    return key